vertical-pod-autoscaler/experiments/sn-pbr-throughput/18minus/user.log
Running 15m test @ http://10.100.240.83:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 26.096ms, rate sampling interval: 81ms
  Thread calibration: mean lat.: 20.252ms, rate sampling interval: 52ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    55.97ms   97.91ms 467.45ms   90.13%
    Req/Sec    14.81     15.57    58.00     83.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   19.39ms
 75.000%   40.32ms
 90.000%  152.19ms
 99.000%  467.45ms
 99.900%  955.90ms
 99.990%    1.29s 
 99.999%    1.42s 
100.000%    1.42s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.497     0.000000            1         1.00
      13.479     0.100000         2657         1.11
      15.079     0.200000         5319         1.25
      16.295     0.300000         7969         1.43
      17.567     0.400000        10642         1.67
      19.391     0.500000        13273         2.00
      20.847     0.550000        14593         2.22
      23.167     0.600000        15929         2.50
      26.271     0.650000        17245         2.86
      30.543     0.700000        18570         3.33
      40.319     0.750000        19897         4.00
      47.359     0.775000        20561         4.44
      58.527     0.800000        21226         5.00
      74.879     0.825000        21885         5.71
      96.255     0.850000        22550         6.67
     120.255     0.875000        23212         8.00
     135.679     0.887500        23543         8.89
     152.191     0.900000        23875        10.00
     170.623     0.912500        24207        11.43
     192.255     0.925000        24538        13.33
     218.239     0.937500        24870        16.00
     233.599     0.943750        25035        17.78
     250.239     0.950000        25202        20.00
     265.983     0.956250        25367        22.86
     285.439     0.962500        25534        26.67
     310.271     0.968750        25699        32.00
     324.095     0.971875        25781        35.56
     338.943     0.975000        25864        40.00
     361.471     0.978125        25947        45.71
     381.695     0.981250        26030        53.33
     404.991     0.984375        26113        64.00
     418.559     0.985938        26154        71.11
     433.407     0.987500        26196        80.00
     451.583     0.989062        26237        91.43
     475.391     0.990625        26279       106.67
     504.063     0.992188        26320       128.00
     532.479     0.992969        26341       142.22
     555.007     0.993750        26362       160.00
     585.215     0.994531        26382       182.86
     608.767     0.995313        26403       213.33
     646.655     0.996094        26424       256.00
     672.767     0.996484        26434       284.44
     714.239     0.996875        26445       320.00
     753.663     0.997266        26455       365.71
     788.479     0.997656        26465       426.67
     828.415     0.998047        26476       512.00
     837.631     0.998242        26481       568.89
     889.855     0.998437        26487       640.00
     931.327     0.998633        26491       731.43
     947.199     0.998828        26496       853.33
     971.263     0.999023        26502      1024.00
     993.279     0.999121        26504      1137.78
    1032.191     0.999219        26507      1280.00
    1039.359     0.999316        26509      1462.86
    1055.743     0.999414        26512      1706.67
    1074.175     0.999512        26515      2048.00
    1075.199     0.999561        26516      2275.56
    1099.775     0.999609        26517      2560.00
    1132.543     0.999658        26518      2925.71
    1151.999     0.999707        26520      3413.33
    1157.119     0.999756        26521      4096.00
    1185.791     0.999780        26522      4551.11
    1185.791     0.999805        26522      5120.00
    1238.015     0.999829        26523      5851.43
    1290.239     0.999854        26524      6826.67
    1290.239     0.999878        26524      8192.00
    1291.263     0.999890        26525      9102.22
    1291.263     0.999902        26525     10240.00
    1291.263     0.999915        26525     11702.86
    1367.039     0.999927        26526     13653.33
    1367.039     0.999939        26526     16384.00
    1367.039     0.999945        26526     18204.44
    1367.039     0.999951        26526     20480.00
    1367.039     0.999957        26526     23405.71
    1424.383     0.999963        26527     27306.67
    1424.383     1.000000        26527          inf
#[Mean    =       55.967, StdDeviation   =       97.910]
#[Max     =     1423.360, Total count    =        26527]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  26854 requests in 15.00m, 350.36MB read
  Socket errors: connect 0, read 0, write 1, timeout 0
Requests/sec:     29.84
Transfer/sec:    398.61KB